In [2]:
import pandas as pd
import numpy as np

What is the average of column num2?

In [3]:

table1 = pd.DataFrame( [
["2014-01-15","176","631.427747","boy","yellow"],
["2014-01-25","330","525.189511","girl","yellow"],
["2014-03-05","260","802.829888","boy","blue"],
["2014-03-27","192","743.697401","girl","red"],
["2014-05-19","254","974.793224","girl","blue"],
["2014-05-27","943","186.433405","girl","yellow"],
["2014-06-19","589","346.259034","boy","green"],
["2014-07-04","690","527.358344","boy","red"],
["2014-08-03","792","73.843848","boy","red"],
["2014-08-06","760","286.984863","girl","red"],
["2014-08-08","71","20.700987","boy","green"],
["2014-09-02","312","845.254480","boy","purple"],
["2014-09-06","279","833.293450","boy","green"],
["2014-09-11","852","473.570358","boy","red"],
["2014-09-21","285","915.997882","girl","red"],
["2014-10-20","330","679.031792","boy","purple"],
["2014-11-06","56","155.091492","boy","red"],
["2014-11-19","518","58.936581","boy","red"],
["2014-12-19","610","899.197993","boy","red"],
["2014-12-19","462","387.648537","girl","blue"],
["2014-12-25","654","346.042252","girl","yellow"],
["2015-02-04","151","421.636419","girl","red"],
["2015-03-15","413","606.343760","girl","yellow"],
["2015-03-25","226","405.178703","boy","green"],
["2015-05-27","954","4.158206","boy","yellow"],
["2015-07-22","493","164.797598","boy","red"],
["2015-08-05","687","277.021994","girl","red"],
["2015-08-12","619","658.618907","boy","blue"],
["2015-08-16","951","724.661845","girl","red"],
["2015-09-21","345","707.051491","girl","red"],
["2015-09-21","250","571.183941","girl","yellow"],
["2015-09-28","940","113.609364","girl","yellow"],
["2015-10-11","918","359.947587","boy","blue"],
["2015-10-29","722","812.100866","boy","purple"],
["2015-10-30","31","566.706857","girl","purple"],
["2015-10-30","638","919.542215","boy","yellow"],
["2015-11-20","456","405.277955","girl","yellow"],
["2015-11-21","965","127.128332","girl","blue"],
["2016-01-04","894","862.674515","girl","red"],
["2016-01-14","133","673.018684","boy","red"],
["2016-03-17","471","533.197723","girl","red"],
["2016-06-07","625","665.043979","boy","red"],
["2016-06-26","545","799.731411","girl","blue"],
["2016-06-29","639","54.200219","girl","green"],
["2016-07-09","6","63.016883","girl","purple"],
["2016-08-16","93","567.060474","girl","yellow"],
["2016-08-26","16","319.226372","girl","purple"],
["2016-09-05","315","116.141924","girl","red"],
["2016-09-20","105","476.725011","girl","red"],
["2016-09-26","305","892.255753","boy","green"]],
   columns = ["date","num","num2","str","str2"])
table1.head()

         date  num        num2   str    str2
0  2014-01-15  176  631.427747   boy  yellow
1  2014-01-25  330  525.189511  girl  yellow
2  2014-03-05  260  802.829888   boy    blue
3  2014-03-27  192  743.697401  girl     red
4  2014-05-19  254  974.793224  girl    blue

In [34]:
table1.info()
table1 = table1.astype({"num": int, "num2": float});
table1.info()
table1["num2"].mean()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
date    50 non-null object
num     50 non-null object
num2    50 non-null object
str     50 non-null object
str2    50 non-null object
dtypes: object(5)
memory usage: 2.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
date    50 non-null object
num     50 non-null int64
num2    50 non-null float64
str     50 non-null object
str2    50 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.1+ KB

491.61684114

2. zad

Group by str and find the sum of column num where the index is boy.

In [36]:
table2 = pd.DataFrame( [
["date","num","num2","str","str2"],
["2014-01-18","972","447.610216","boy","red"],
["2014-02-05","945","163.364858","boy","green"],
["2014-02-14","711","244.103166","girl","green"],
["2014-02-25","253","551.958346","boy","green"],
["2014-04-16","123","237.824666","girl","blue"],
["2014-05-15","35","808.260511","girl","red"],
["2014-05-29","428","682.510660","girl","red"],
["2014-06-19","795","762.252145","girl","green"],
["2014-06-21","148","15.515414","boy","green"],
["2014-07-04","514","228.735641","girl","yellow"],
["2014-07-06","154","817.175051","girl","blue"],
["2014-07-09","853","408.568399","girl","yellow"],
["2014-07-20","60","418.185172","boy","red"],
["2014-07-25","293","942.594243","boy","blue"],
["2014-08-06","351","742.921666","boy","green"],
["2014-08-23","254","260.215083","boy","red"],
["2014-10-01","70","144.219516","boy","purple"],
["2014-10-01","946","642.952792","boy","green"],
["2014-12-12","967","633.551347","girl","blue"],
["2015-01-09","961","719.305828","boy","red"],
["2015-01-17","83","823.516632","girl","blue"],
["2015-02-10","698","240.010873","boy","blue"],
["2015-03-01","828","624.912497","girl","yellow"],
["2015-03-10","781","219.765560","boy","blue"],
["2015-03-19","650","475.159931","girl","yellow"],
["2015-03-29","529","121.535897","boy","green"],
["2015-04-13","836","150.936172","girl","yellow"],
["2015-04-18","84","955.511477","girl","yellow"],
["2015-05-25","542","322.430859","girl","green"],
["2015-08-02","537","94.121788","boy","purple"],
["2015-08-09","835","891.005798","girl","yellow"],
["2015-08-31","278","925.196594","girl","green"],
["2015-11-11","54","507.628181","girl","blue"],
["2015-12-08","735","955.895300","boy","red"],
["2015-12-25","617","530.828915","boy","green"],
["2016-01-17","335","170.023531","girl","purple"],
["2016-01-27","284","58.113152","girl","blue"],
["2016-02-15","816","589.178563","girl","green"],
["2016-02-16","236","8.046423","girl","yellow"],
["2016-03-07","121","554.911955","boy","red"],
["2016-05-08","143","440.191357","boy","green"],
["2016-05-09","798","984.784592","boy","blue"],
["2016-05-28","464","293.560060","girl","purple"],
["2016-07-16","868","23.970083","boy","purple"],
["2016-07-23","848","52.273804","girl","red"],
["2016-08-03","657","203.270139","boy","yellow"],
["2016-08-07","69","754.322351","boy","purple"],
["2016-08-21","11","103.523379","girl","green"],
["2016-08-29","16","256.378778","girl","purple"],
["2016-09-05","71","78.447034","girl","green"]],
columns = ["date","num","num2","str","str2"])
table2.head()

         date  num        num2   str   str2
0        date  num        num2   str   str2
1  2014-01-18  972  447.610216   boy    red
2  2014-02-05  945  163.364858   boy  green
3  2014-02-14  711  244.103166  girl  green
4  2014-02-25  253  551.958346   boy  green

In [41]:
table1.info()
table1 = table1.astype({"num": int, "num2": float, "date": "datetime64[ns]"});
table1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
date    50 non-null object
num     50 non-null int64
num2    50 non-null float64
str     50 non-null object
str2    50 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
date    50 non-null datetime64[ns]
num     50 non-null int64
num2    50 non-null float64
str     50 non-null object
str2    50 non-null object
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.1+ KB

491.61684114

In [79]:
table2.head()
table2.loc[table2["str"]== "boy", ["num"]].sum()

num    9.729453e+65
dtype: float64

In [50]:
pd.__version__

'0.25.1'

In [51]:
pd.show_versions(as_json=False)

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.7.4.final.0
python-bits      : 64
OS               : Linux
OS-release       : 5.3.0-42-generic
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 0.25.1
numpy            : 1.17.2
pytz             : 2019.3
dateutil         : 2.8.0
pip              : 19.2.3
setuptools       : 41.4.0
Cython           : 0.29.13
pytest           : 5.2.1
hypothesis       : None
sphinx           : 2.2.0
blosc            : None
feather          : None
xlsxwriter       : 1.2.1
lxml.etree       : 4.4.1
html5lib         : 1.0.1
pymysql          : None
psycopg2         : None
jinja2           : 2.10.3
IPython          : 7.8.0
pandas_datareader: None
bs4              : 4.8.0
bottleneck       : 1.2.1
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.4.1
matplotlib       : 3.1.1
numexpr          : 2.7.0
odfpy            : None
openpyxl         : 3.0.0
pandas_gbq       : None
pyarrow          : None
pytables         : None
s3fs             : None
scipy            : 1.3.1
sqlalchemy       : 1.3.9
tables           : 3.5.2
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
xlsxwriter       : 1.2.1